NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/BGM22/BGM220PC22HNA.svd
        <register>
          <name>VITERBIDEMOD</name>
          <description>No Description</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00206100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VTDEMODEN</name>
              <description>Viterbi demodulator enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HARDDECISION</name>
              <description>Hard decision</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VITERBIKSI1</name>
              <description>VITERBI KSI1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VITERBIKSI2</name>
              <description>VITERBI KSI2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VITERBIKSI3</name>
              <description>VITERBI KSI3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNTHAFC</name>
              <description>Synthesizer AFC in Viterbi demod</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORRCYCLE</name>
              <description>Correction cycles</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORRSTPSIZE</name>
              <description>Correction step size</description>
              <bitOffset>27</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISDEMODOF</name>
              <description>Disable Demod Over Flow Detection</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VTCORRCFG0</name>
          <description>No Description</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
          <resetValue>0x123556B7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXPECTPATT</name>
              <description>Expected pattern</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIGMIXCTRL</name>
          <description>No Description</description>
          <addressOffset>0x10C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x007FFFFF</resetMask>
          <fields>
            <field>
              <name>DIGMIXFREQ</name>
              <description>Digital mixer frequency control word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIGMIXMODE</name>
              <description>Digital mixer frequency control</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CFOSR</name>
                  <description>Mixer frequency specified by CFOSR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIGMIXFREQ</name>
                  <description>Mixer frequency specified by DIGMIXFREQ.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MIXERCONJ</name>
              <description>Digital mixer input conjugate</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIGMIXFB</name>
              <description>Digital mixer Frequency Correction </description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VTCORRCFG1</name>
          <description>No Description</description>
          <addressOffset>0x110</addressOffset>
          <access>read-write</access>
          <resetValue>0x29043020</resetValue>
          <resetMask>0x7FFFFFFF</resetMask>
          <fields>
            <field>
              <name>CORRSHFTLEN</name>
              <description>Correlator shift length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VTFRQLIM</name>
              <description>Viterbi frequency limiter</description>
              <bitOffset>6</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXPSYNCLEN</name>
              <description>Expected sync length</description>
              <bitOffset>15</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUFFHEAD</name>
              <description>Buffer header</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXPECTHT</name>
              <description>Expected patterns head and tail</description>
              <bitOffset>27</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VTTRACK</name>
          <description>No Description</description>
          <addressOffset>0x114</addressOffset>
          <access>read-write</access>
          <resetValue>0x4D80BB88</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FREQTRACKMODE</name>
              <description>Frequency tracking mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Frequency tracking disabled. Only a one-time frequency offset compensation applied through DSA.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE1</name>
                  <description>Frequency tracking enabled with one correction, when needed, every 16 symbol periods.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE2</name>
                  <description>Frequency tracking enabled with one correction, when needed, every 32 symbol periods.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE3</name>
                  <description>Frequency tracking enabled with one correction, when needed, every 48 symbol periods.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMTRACKTHD</name>
              <description>Timing tracking threshold</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEACQUTHD</name>
              <description>Time acquisition threshold</description>
              <bitOffset>6</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMCHK</name>
              <description>Time check</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUTMODE</name>
              <description>Timeout mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMGEAR</name>
              <description>Timing Gear</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GEAR0</name>
                  <description>Execute timing tracking regardless of difference between Early/Late and Current correlation values. Referred to as fast gear. Same as GEAR3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GEAR1</name>
                  <description>Execute timing tracking only when correlation value of Early/Late is 75% or less of the Current correlation value. Referred to as medium gear.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GEAR2</name>
                  <description>Execute timing tracking only when correlation value of Early/Late is 50% or less of the Current correlation value. Referred to as slow gear.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FREQBIAS</name>
              <description>Frequency estimation bias</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIPWRTHD</name>
              <description>High Power detection threshold</description>
              <bitOffset>22</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCTIMEOUTSEL</name>
              <description>SYNC-WORD DET TIMEOUT</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BREST</name>
          <description>No Description</description>
          <addressOffset>0x118</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FF</resetMask>
          <fields>
            <field>
              <name>BRESTINT</name>
              <description>Integer part of estimated baudrate</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BRESTNUM</name>
              <description>Fractional part of estimated baudrate</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUTOCG</name>
          <description>No Description</description>
          <addressOffset>0x124</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>AUTOCGEN</name>
              <description>Enable automatic clock gating</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CGCLKSTOP</name>
          <description>No Description</description>
          <addressOffset>0x128</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>FORCEOFF</name>
              <description>Manual control clocks</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSATHD2</name>
          <description>No Description</description>
          <addressOffset>0x130</addressOffset>
          <access>read-write</access>
          <resetValue>0x0C660664</resetValue>
          <resetMask>0x7FFFFEFF</resetMask>
          <fields>
            <field>
              <name>POWABSTHDLOG</name>
              <description>Power threshold in logarithm-scale </description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JUMPDETEN</name>
              <description>Power jump detection enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FDADJTHD</name>
              <description>Frequency deviation ripple threshold</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMDETPASSTHD</name>
              <description>DSA Preamble detection counter threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FREQESTTHD</name>
              <description>Frequency Estimation Timeout Threshold</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTERFERDET</name>
              <description>Interference detection threshold</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMDETFORCE</name>
              <description>Force DSA preamble detector</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIRECTMODE</name>
          <description>No Description</description>
          <addressOffset>0x134</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000010C</resetValue>
          <resetMask>0x00001F0F</resetMask>
          <fields>
            <field>
              <name>DMENABLE</name>
              <description>Enable Direct Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCASYNC</name>
              <description>Choose Synchronous or Asynchronous mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCPREAM</name>
              <description>Synchronous mode preamble</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADD0</name>
                  <description>No preamble bits appended</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADD8</name>
                  <description>8 preamble bits appended</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADD16</name>
                  <description>16 preamble bits appended</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADD32</name>
                  <description>32 preamble bits appended</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKWIDTH</name>
              <description>Synchronous mode clock pulse width</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LONGRANGE</name>
          <description>No Description</description>
          <addressOffset>0x138</addressOffset>
          <access>read-write</access>
          <resetValue>0x00FA53E8</resetValue>
          <resetMask>0x7FFFFFFF</resetMask>
          <fields>
            <field>
              <name>LRCORRTHD</name>
              <description>Correlator threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCORRSCHWIN</name>
              <description>Window size</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRBLE</name>
              <description>Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRTIMCORRTHD</name>
              <description>Correlator threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRBLEDSA</name>
              <description>DSA enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRDEC</name>
              <description>DEC value</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LONGRANGE1</name>
          <description>No Description</description>
          <addressOffset>0x13C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFF7FFF</resetMask>
          <fields>
            <field>
              <name>LRSS</name>
              <description>Long Range Signal Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRTIMEOUTTHD</name>
              <description>Long Range Time Out Threshold</description>
              <bitOffset>4</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHPWRACCUDEL</name>
              <description>Channel Power Accumulated Delay</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEL0</name>
                  <description>Use accumulated channel power value</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEL32</name>
                  <description>Delayed by 32 chips</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEL64</name>
                  <description>Delayed by 64 chips</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYSVAL</name>
              <description>Hysteresis Value for BBSS</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AVGWIN</name>
              <description>Average window</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRSPIKETHADD</name>
              <description>Long Range DSA spike threshold addition</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOGICBASEDPUGATE</name>
              <description>Logic Based Phase Unwrap Gating</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOGICBASEDLRDEMODGATE</name>
              <description>Logic Based Long Range Demod Gating</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
