NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/BGM22/BGM220PC22HNA.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DEVINFO</name>
      <version>1</version>
      <description>DEVINFO Registers</description>
      <baseAddress>0x0FE08000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>INFO</name>
          <description>Version of the device info structure being used</description>
          <addressOffset>0x000</addressOffset>
          <access>read-only</access>
          <resetValue>0x07000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CRC</name>
              <description>CRC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRODREV</name>
              <description>Production Revision</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DEVINFOREV</name>
              <description>DI Page Version</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PART</name>
          <description>Part description</description>
          <addressOffset>0x004</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3F3FFFFF</resetMask>
          <fields>
            <field>
              <name>DEVICENUM</name>
              <description>Device Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAMILYNUM</name>
              <description>Device Family</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAMILY</name>
              <description>Device Family</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FG</name>
                  <description>Flex Gecko</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MG</name>
                  <description>Mighty Gecko</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BG</name>
                  <description>Blue Gecko</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PG</name>
                  <description>Pearl Gecko</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMINFO</name>
          <description>Flash page size and misc. chip information</description>
          <addressOffset>0x008</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLASHPAGESIZE</name>
              <description>Flash Page Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>UDPAGESIZE</name>
              <description>User Data Page Size</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DILEN</name>
              <description>Length of DI Page</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSIZE</name>
          <description>Flash and SRAM Memory size in kB</description>
          <addressOffset>0x00C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07FFFFFF</resetMask>
          <fields>
            <field>
              <name>FLASH</name>
              <description>Flash Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SRAM</name>
              <description>Sram Size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKGINFO</name>
          <description>Miscellaneous device information</description>
          <addressOffset>0x010</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>TEMPGRADE</name>
              <description>Temperature Grade</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>N40TO85</name>
                  <description>-40 to 85 degC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N40TO125</name>
                  <description>-40 to 125 degC</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N40TO105</name>
                  <description>-40 to 105 degC</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N0TO70</name>
                  <description>0 to 70 degC</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PKGTYPE</name>
              <description>Package Type</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WLCSP</name>
                  <description>WLCSP package</description>
                  <value>74</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BGA</name>
                  <description>BGA package</description>
                  <value>76</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QFN</name>
                  <description>QFN package</description>
                  <value>77</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QFP</name>
                  <description>QFP package</description>
                  <value>81</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINCOUNT</name>
              <description>Pin Count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CUSTOMINFO</name>
          <description>Custom information</description>
          <addressOffset>0x014</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF0000</resetMask>
          <fields>
            <field>
              <name>PARTNO</name>
              <description>Part Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWFIX</name>
          <description>Used to track s/w workaround info</description>
          <addressOffset>0x018</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSV</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWCAPA0</name>
          <description>Software Capability Vector 0</description>
          <addressOffset>0x01C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00333333</resetMask>
          <fields>
            <field>
              <name>ZIGBEE</name>
              <description>Zigbee Capability</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEVEL0</name>
                  <description>Zigbee stack capability not available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL1</name>
                  <description>Green Power only</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL2</name>
                  <description>Zigbee and Green Power</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL3</name>
                  <description>Zigbee Only</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>THREAD</name>
              <description>Thread Capability</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEVEL0</name>
                  <description>Thread stack capability not available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL1</name>
                  <description>Thread stack enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL2</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL3</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RF4CE</name>
              <description>RF4CE Capability</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEVEL0</name>
                  <description>RF4CE stack capability not available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL1</name>
                  <description>RF4CE stack enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL2</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL3</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BTSMART</name>
              <description>Bluetooth Smart Capability</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEVEL0</name>
                  <description>Bluetooth SMART stack capability not available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL1</name>
                  <description>Bluetooth SMART enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL2</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL3</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CONNECT</name>
              <description>Connect Capability</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEVEL0</name>
                  <description>Connect stack capability not available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL1</name>
                  <description>Connect enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL2</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL3</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRI</name>
              <description>RAIL Capability</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LEVEL0</name>
                  <description>RAIL capability not available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL1</name>
                  <description>RAIL enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL2</name>
                  <description>N/A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL3</name>
                  <description>N/A</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SWCAPA1</name>
          <description>Software Capability Vector 1</description>
          <addressOffset>0x020</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>RFMCUEN</name>
              <description>RF-MCU</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NCPEN</name>
              <description>NCP</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GWEN</name>
              <description>Gateway</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTINFO</name>
          <description>External component description</description>
          <addressOffset>0x028</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>TYPE</name>
              <description>Type</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description></description>
                  <value>255</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CONNECTION</name>
              <description>Connection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI</name>
                  <description>SPI control interface</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interface</description>
                  <value>255</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REV</name>
              <description>Revision</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EUI48L</name>
          <description>MA-L compliant EUI48 OUI (low bits) and Unique Identifier (24-bit)</description>
          <addressOffset>0x040</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UNIQUEID</name>
              <description>Unique ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUI48L</name>
              <description>OUI48L</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EUI48H</name>
          <description>MA-L compliant EUI48 OUI (high bits)</description>
          <addressOffset>0x044</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFF0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OUI48H</name>
              <description>OUI48H</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RESERVED</name>
              <description>RESERVED</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EUI64L</name>
          <description>MA-L compliant EUI64 Unique Identifier (low bits)</description>
          <addressOffset>0x048</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UNIQUEL</name>
              <description>UNIQUEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EUI64H</name>
          <description>MA-L compliant EUI64 OUI and Unique Identifier (high bits)</description>
          <addressOffset>0x04C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UNIQUEH</name>
              <description>UNIQUEH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUI64</name>
              <description>OUI64</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALTEMP</name>
          <description>Calibration Temperature Information</description>
          <addressOffset>0x050</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>TEMP</name>
              <description>Cal Temp</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMUTEMP</name>
          <description>EMU Temperature Sensor Calibration</description>
          <addressOffset>0x054</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1FFF07FC</resetMask>
          <fields>
            <field>
              <name>EMUTEMPROOM</name>
              <description>Emu Room Temperature</description>
              <bitOffset>2</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
